{
  "Hunting": [
    {
      "displayName": "HuntingRule01",
      "description": "test 1",
      "query": "SecurityEvent | where EventID == \"4688\" | where CommandLine contains \"-noni -ep bypass $\"",
      "tactics": [
        "Persistence",
        "LateralMovement",
        "Collection"
      ]
    },
    {
      "displayName": "HuntingRule02",
      "description": "test2",
      "query": "SecurityEvent | where EventID == \"4688\" | where CommandLine contains \"-noni -ep bypass $\"",
      "tactics": [
        "Persistence",
        "LateralMovement"
      ]
    }
  ]
}
